# Базовый образ контейнера
FROM node:14
# Создание рабочей директории
WORKDIR /app
# копирование исходников приложения, чтобы папка с приложением и файлы докера лежали на одном уровне
COPY ./covid-test-result-service/ .
# Установка npm пакетов и build node js приложения при сборке контейнера
RUN npm install && npm run build
# Указываем порт на котором будет работать приложение
EXPOSE 5000
# Команда которая запускается при запуске или при перезапуске контейнера
CMD [ "node", "./build/server.js" ]